run/scatteringPhaseFunction-v1906/0/gas/IDefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
	location 	"0/gas";
    object      IDefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0]; 

internalField   uniform 0;


boundaryField
{
    bottomPlate
    {
        type            greyMGZDiffusiveRadiation;
        value           uniform 0;
    }
	
	topPlate
    {
        type            greyMGZDiffusiveRadiation;
        value           uniform 0;
    }

	plateWall
	{
        type            greyMGZDiffusiveRadiation;
        value           uniform 0;
	}
}

// ************************************************************************* //