run/scatteringPhaseFunction-v1906/0/gas/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/gas";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0]; 


internalField   uniform (0 0 0); 

boundaryField
{
    bottomPlate
    {
        type            fixedValue;
        value           uniform (0 0 0); 
    }
    
	topPlate
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
	plateWall
    {
        type            fixedValue;
		value			uniform (0 0 0);
    }
}


// ************************************************************************* //