run/scatteringPhaseFunction-v1906/0/gas/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
	location	"0/gas";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000; 


boundaryField
{
    bottomPlate
    {
        type            zeroGradient;
    }

    topPlate
    {
        type            zeroGradient;
    }
	
    plateWall
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //