run/scatteringPhaseFunction-v1906/constant/gas/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/gas";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
	solver			EulerImplicit; 
}

chemistry			off; 

initialChemicalTimeStep		1e-07;

odeCoeffs
{
	solver			seulex; 
	eps				0.05; 
}

EulerImplicitCoeffs
{
	cTauChem					1;
	equilibriumRateLimiter		off; 
}



// ************************************************************************* //