run/scatteringPhaseFunction-v1906/constant/gas/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/gas";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation       on; 

radiationModel  fvDOMScatter; 


fvDOMScatterCoeffs
{
	nPhi		1; 	
	nTheta		2; 	
	tolerance	1e-4;
	maxIter		10;		
}

solverFreq 10;

absorptionEmissionModel	constantAbsorptionEmission;

constantAbsorptionEmissionCoeffs
{
	absorptivity	absorptivity	[0 -1 0 0 0 0 0]			12.5; 
	emissivity		emissivity		[0 -1 0 0 0 0 0]			12.5; 
	E				E				[1 -1 -3 0 0 0 0]			0.0; 
}

scatterModel	none; 

constantScatterCoeffs
{
	sigma	0; 
	C 		0; 
}

sootModel		none;


// ************************************************************************* //