run/scatteringPhaseFunction-v1906/constant/gas/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/gas";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



thermoType
{
	type			heRhoThermo; 
	mixture			reactingMixture; 
	transport		const;
	thermo			hConst;
	equationOfState	perfectGas; 
	specie			specie; 
	energy			sensibleEnthalpy; 
}

inertSpecie			N2; 

chemistryReader		foamChemistryReader; 

foamChemistryFile	"$FOAM_CASE/constant/gas/reactions"; 

foamChemistryThermoFile		"$FOAM_CASE/constant/gas/thermo.compressibleGas"; 

// ************************************************************************* //