run/scatteringPhaseFunction-v1906/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


scale   1;


/* Coordinate Definition
 * 
 * 				3--------2
 * 				| \		 . \
 * 				|  \     .  \
 * 				|	7--------6
 * 	y			|   |    .   |
 * 	^			|   |    .   |
 * 	|			0 ..|....1   |
 * 	|			  \	|	   \ |
 * 	|---->x 	   \|       \|
 * 	\				4--------5
 * 	 \
 * 	  \
 * 	   V z
 */

vertices
(
    (0 0 0) //vertex #0
    (0.04 0 0) //1
    (0.04 0.5 0) //2
    (0 0.5 0) //3
    (0 0 0.5) //4
    (0.04 0 0.5) //5
    (0.04 0.5 0.5) //6
    (0 0.5 0.5) //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) gas (100 50 50) 
	simpleGrading 
	(
		(
			(0.2 0.3 4)
			(0.6 0.4 1)
			(0.2 0.3 0.25)
		)
		1 
		1
	)
	//hex (vertices to make the block) (#cells in each direction) simpleGrading (cell expansion in each direction for inflation layer)
);

edges
(
);

boundary
(	
	bottomPlate
	{
		type wall;
		faces
		(
			(0 4 7 3)
		);
	}
	
	topPlate
	{
		type wall;
		faces
		(
			(2 6 5 1)
		);
	}
	
	plateWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
			(7 4 5 6)
			(4 0 1 5)
			(2 1 0 3)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
