run/scatteringPhaseFunction-v1906/system/gas/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


ddtSchemes
{
    default         Euler; 
}

gradSchemes
{
    default         leastSquares linear; 
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss upwind;
	div(phi,K)		Gauss linear; 
	div(phi,h)		Gauss upwind;
	div(phi,k)		Gauss upwind; 
	div(phi,epsilon) Gauss upwind;
	div(phi,R)		Gauss upwind;
	div(R)			Gauss linear; 
	div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear; 
	div(phi,Yi_h)	Gauss upwind; 
	div(Ji,Ii_h)	Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear orthogonal; 
}

interpolationSchemes
{
    default         linear; 
}

snGradSchemes
{
    default         orthogonal; 
}


// ************************************************************************* //